function ai_on(){







var quests=[
'Критерием правильной трансформации телесных метафор является',
'В релаксационном комплексе работа с телом начинается с зоны',
'Основными техническими приёмами в палсинге являются:',
'При покачивании области спины акцент делается на', 
'Работа с областью головы и шеи в релаксационном комплексе занимает по времени в среднем',
'В. Райх ввёл в психотерапию понятие:',
'Первым по времени формируется характер:',
'Технику “энергетических кругов” рекомендуется проводить',
'При работе с областью головы и лица в релаксационном комплексе основной акцент делается на',
'Чрезмерная фиксация в области шеи и грудной клетки свидетельствуют о состоянии:',
'Сегменты “мышечной брони” расположены по отношению к позвоночнику:',
'В. Райх заметил, что работа с телом ускоряет процессы:',
'Наиболее эффективным при работе с телесными метафорами (ТМ) является использование:',
'Райх назвал энергию, циркулирующую в теле:',
'Идею о том, что личность терапевта является определяющей в процессе терапии выдвинул:',
'Челюстной зажим блокирует:',
'Дж. Перракос выделяет аспекты чакр:',
'Чакра считается открытой, когда маятник:',
'В восточной традиции “плотинами” для течения энергии считались',
'Непосредственными учеником В. Райха являлся:',
'Тазовый зажим блокирует:',
'Люди с близкой психологической проблематикой имеют, по мнению В. Райха:',
'Точкой входа в канал защитной энергии является',
'Приём “когти тигра” позаимствован из',
'Основателем современной ТОП является',
'Передняя поверхность тела рассматривается как:',
'Работа с телесными метафорами (ТМ) наиболее эффективна:',
'Область кистей относится:',
'Автором метода танатотерапии является:',
'Проблемы с выражением эмоций наиболее выражены у характера:',
'В биоэнергетике выделяется:',
'Проекцией позвоночника на ушной раковине является',
'Технической основой БЭСТа является',////
'При ограниченном телесном контакте с матерью в первый год жизни формируется характер:',
'Средняя продолжительность релаксационного комплекса',////
'Какой тип характера наиболее энергетически «обесточен»:',
'Райх выделил:',
'“Отражением” основания затылочной кости является',
'Вращения ушной раковины рекомендуется производить',
'При неверном ощущении “точки индикатора” канала защитной энергии рекомендуется',
'С каким типом характера, по мнению А. Лоуэна, труднее всего работать в биоэнергетических подходах:',
'Вялые мягкие мышцы, холодные кисти и стопы – признак:',
'В процессе терапии В. Райх:',
'ТОП делится на два больших направления. Они разделяются по принципу:',
'В восточной медицине нормальной формой пупка считалась',////
'Шизоидный тип чаще:',
'Противопоказанием для ТОП являются:',
'Какой тип характера называют ещё «контролирующим»:',
'“Руки – это вынесенный наружу головной мозг”. Высказывание принадлежит',
'При работе с каналом защитной энергии терапевт стремится достичь между руками ощущения',////
'При работе с каналом защитной энергии у клиента более предпочтительны ощущения',
'В. Райх чаще использовал техники:',////
'Какой тип характера, по мнению А. Лоуэна, формируется последним:',
'Развитием райхианской терапии являлось:',////
'Для диагностики чакр используются:',
'Область почек в ТОП является зоной',
'Биоэнергетика дополнила райхианскую терапию:',
'Проблемы с ногами, плохая устойчивость свидетельствуют о:',
'Техника “имитации филиппинских операций” относится к',////
'У ригидного типа могут быть проблемы в проявлении:',
'При растяжке ног используется ротация стопы',
'Наиболее близки к райхианской терапии были:',////
'У людей европейской культуры фокус внимания находится в основном в области:',
'Люди с каким типом характера более склонны к манипуляции:',
'Выразить сильные эмоции труднее всего:',////
'Выделяются для диагностики:',////
'В рольфинге в основном используется:',
'Основание затылочной кости является частью',
'Проекцией зон головы на ладони является',
'У мазохистского типа максимальное напряжение:',
'Нарушение координации движения наиболее свойственно типу:',
'Какой тип характера формируется при сильном доминировании одного из родителей:',
'При подавлении сексуальности ребёнка может сформироваться тип характера:',
'При работе с телесными метафорами (ТМ) наиболее экологичным является:',
'Для формирования “энергетических кругов” используется приём',
'Технику канала защитной энергии рекомендуется проводить',
'На канале защитной энергии выделяется основных точек',
'Чакра считается полностью закрытой, когда:',
'Серединой канала защитной энергии (КЗЭ) является',
'Рекомендуемая длительность растяжки в БЭСТе',////
'Прямыми показаниями к проведению релаксационного комплекса являются',
'Работу с областью живота в релаксационном комплексе рекомендуется начинать',
'В рольфинге основной акцент делается на:',////
'Точкой выхода из канала защитной энергии является',
'В розен-терапии основной акцент делается на:',////
'Приём “когти тигра” снимает напряжение с зон',
'По древневосточным представлениям защитная энергия циркулирует',
'Растяжки направлены на',////
'Синий и фиолетовый цвета, которые видит клиент при работе с областью таза,  свидетельствуют о перегрузке:',
'Какую область тела в ТОП называют “кладбищем эмоций”',
'При работе  с телесными метафорами (ТМ) наиболее важны:',
'Самым популярным на сегодняшний день направлением ТОП в мире является:',
'В славянской традиции “зоной ревности” считается',////
'У ригидного типа зона наибольшего напряжения в области:',
'При правильном выполнении растяжки активизируется',
'Работу с руками в рамках релаксационного комплекса рекомендуется начинать',
'Если клиент при работе с зонами головы видит красный или оранжевый цвет, это свидетельствует о перегрузке:',
'С чувством идентичности связана зона:',
'Признаком более тяжёлого психо-эмоционального состояния являются ощущения:',
'В приёмах релаксационного комплекса используется',
'Прямыми показаниями к проведению релаксационного комплекса являются'
];







var answers=[
1,
2,
2,
2,
2,
2,
1,
0,
2,
2,
0,
1,
1,
0,
2,
0,
2,
0,
1,
2,
0,
0,
0,
0,
0,
1,
0,
0,
2,
1,
0,
2,
1,
0,
2,
1,
1,
0,
0,
2,
1,
2,
0,
2,
1,
0,
2,
0,
2,
2,
2,
0,
2,
1,
0,
1,
1,
1,
0,
0,
0,
2,
2,
1,
1,
1,
0,
2,
2,
1,
2,
2,
2,
0,
1,
1,
2,
1,
2,
2,
2,
0,
2,
0,
2,
0,
1,
0,
2,
1,
2,
2,
0,
1,
0,
2,
2,
1,
0,
1,
2
];
$(document).ready(function(){
var quest = $.trim($(".testQuestionText").text());
 var re = new RegExp(String.fromCharCode(160), "g");
 quest = quest.replace(re, " ");
var ind = quests.indexOf(quest);
if (ind!=-1){
$("#radio-0").removeAttr("checked");
$("#radio-0").parent().removeClass("r_on");
$("#radio-"+answers[ind]).attr("checked", true);
$("#radio-"+answers[ind]).parent().addClass("r_on");
console.warn(ind);
//console.log("#radio-"+answers[ind]);

$("#questionForm").submit();
}else{
console.log(quest);
}
});
}